// Тут указываем что это класс, и что он имеет название "ИмяКласса"
// Обязательно все методы, переменные записываем в фигурные скобки, иначе Java не поймёт, где начало ваших мыслей
// А где конец вашей жизни.

public class ClassExample {
    // Данный метод может быть только ОДИН, на всю программу.
    // Это входная точка в программу.
    // Короче эта хрень вызывается при запуске кода.
    public static void main(String[] args) {System.out.println("Hello world!");
    }

        // Код, который будет вызываться при запуске программы.

}
